{"body": [{"body": [{"body": [{"indent": 4, "type": "para", "extent": [62, 975], "text": ["This determines how strongly the cloth object resists deformation. The ", {"text": ["Overall Stiffness"], "type": "ui"}, " is independent of the resolution of the mesh. If the ", {"text": ["materialuv"], "type": "code"}, " attribute is used to specify cloth UV coordinates are specified on the mesh, then the effect of stiffness is also independent of the orientations of the triangles and quads in the mesh. The default setting for the ", {"text": ["Overall Stiffness"], "type": "ui"}, " works the best if you model the simulation geometry to real size. If you don’t model your geometry in meters, then make sure that you set the correct units of length in the Hip File Options. This should be done ", {"text": ["before"], "type": "strong"}, " you create your DOP network. When using real-size models, you should make sure that you have your length units set correctly before you create your DOP network: You should set the correct ", {"text": ["Unit Length"], "type": "ui"}, " in ", {"text": ["Edit"], "type": "ui"}, " > ", {"text": ["Preferences"], "type": "ui"}, " > ", {"text": ["Hip File Options"], "type": "ui"}, " before you create your DOP network."]}], "indent": 0, "text": ["Overall Stiffness"], "attrs": {"id": "overallstiffness"}, "extent": [16, 35], "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [1028, 1587], "text": ["This value should lie between 0 and 1. The ", {"text": ["Overall Damping Ratio"], "type": "ui"}, " controls the rate of energy loss as a result of the rate of deformation. A value of 0 means that there is no loss of energy due to internal damping forces. A value of 1 means that the object is critically damped, in which case the object comes to rest in the quickest possible way without oscillating. The higher the damping ratio, the less the cloth oscillates and the quicker the object’s motion will come to rest. The effect of damping is independent of your geometry’s resolution."]}], "indent": 0, "text": ["Overall Damping Ratio"], "attrs": {"id": "overalldampingratio"}, "extent": [975, 998], "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [1645, 1852], "text": ["This is the mass per square meter. The mass density can be made lower or higher in parts of the object using the primitive attribute ", {"text": ["surfacemassdensity"], "type": "code"}, ", which works as a multiplier for the parameter."]}], "indent": 0, "text": ["Surface Mass Density"], "attrs": {"channels": "/surfacemassdensity"}, "extent": [1587, 1609], "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [1900, 2773], "text": ["These values should lie between 0 and 1 and act as modifiers to the ", {"text": ["Overall Stiffness"], "type": "ui"}, " for specific types of deformation. The ", {"text": ["Relative Stiffness"], "type": "ui"}, " parameters determine the relative strengths of the internal forces that counteract planar shape changes and bending. Together, the ", {"text": ["Relative Stiffness"], "type": "ui"}, " contributions for stretch and shear determine the resistance against changes within the local cloth surface plane. The contribution for Weak Bend and Strong Bend determine how strongly the object resists bending. The Weak Bend model can be used to create thin silky kinds of cloth sheets. The Strong Bend model can be used to create a strong resistance against bending, for example, for leather or thick rubber. The effect of ", {"text": ["Relative Stiffness"], "type": "ui"}, " is independent of the amount of detail and the shapes of the triangles and quadrangles your simulation geometry."]}, {"body": [{"indent": 7, "type": "para", "extent": [3247, 3569], "text": ["Each of the ", {"text": ["Relative Stiffness"], "type": "ui"}, " parameters assigns a uniform stiffness over the entire object. If you want to make parts of the object weaker or stronger, then you can locally multiply the stiffness using the point attributes ", {"text": ["clothstretchhstiffness"], "type": "code"}, ", ", {"text": ["clothshearstiffness"], "type": "code"}, ", and ", {"text": ["clothvolumestiffness"], "type": "code"}, ".        "]}], "indent": 4, "type": "para", "extent": [2773, 3247], "text": ["The stretch and shear contributions of ", {"text": ["Relative Stiffness"], "type": "ui"}, " work in the directions of the cloth material UV’s. These UV coordinates can be specified by the ", {"text": ["materialuv"], "type": "code"}, " vertex or point attribute. When no UV coordinates are specified, the material directions are determined by the polygon edges. The Visualization tab of the Cloth Object has an option that allows you to see which UV directions are being currently used by the ", {"text": ["cloth object"], "fullpath": "/nodes/dop/clothobject", "scheme": "Node", "type": "link", "value": "/nodes/dop/clothobject"}, "."]}], "indent": 0, "text": ["Relative Stiffness"], "attrs": {"id": "relativestiffness"}, "extent": [1852, 1872], "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [3624, 3917], "text": ["These values should lie between 0 and 1 and act as modifiers to the ", {"text": ["Overall Damping Ratio"], "type": "ui"}, ". The ", {"text": ["Relative Damping Ratio"], "type": "ui"}, " parameters allow you to determine separately how much energy loss is introduced by the rate of changes in planar shape (stretch + shear) and the rate of bending."]}], "indent": 0, "text": ["Relative Damping Ratio"], "attrs": {"id": "relativedampingratio"}, "extent": [3569, 3593], "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [3959, 4406], "text": ["These values allow you to very the strength of the internal stress within the cloth surface separately for the U and V directions. The U and V directions can be provided using the vertex and point attributes ", {"text": ["materialuv"], "type": "code"}, ". For example, to make the cloth more stretchy in the U direction than in the V direction, you could set a lower value (say 0.5) for the U component of the ", {"text": ["Anisotropic Strength"], "type": "ui"}, " while keeping the V component unchanged."]}], "indent": 0, "text": ["Anisotropic Strength"], "attrs": {"id": "aniso"}, "extent": [3917, 3939], "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [4445, 4985], "text": ["This is the rest angle along edges between two primitives that belong to separate panels. Panels are connected by pinning together two cloth objects using a stitch constraint or by specifying separate per-vertex rest positions within a single ", {"text": ["cloth object"], "fullpath": "/nodes/dop/clothobject", "scheme": "Node", "type": "link", "value": "/nodes/dop/clothobject"}, ". The seam angle does not affect the rest angle for polygons that lie within a single panel. If you want to make parts of the object have different rest angles, then you can locally multiply the rest angle using the primitive attribute ", {"text": ["seamangle"], "type": "code"}, "."]}], "indent": 0, "text": ["Seam Angle"], "attrs": {"channels": "/seamangle"}, "extent": [4406, 4418], "type": "dt"}], "container": true, "type": "dt_group"}], "type": "root", "attrs": {"type": "include"}}